---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionSettings.IncludeWarningControls
source: html/401729b1-e312-6b68-ada6-7f813cb4ef42.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionSettings.IncludeWarningControls Property

This property controls how Structural Connection Element is generated.
 If set to true and warnings are reported for given Element, additional yellow triangle is displayed.

## Syntax (C#)
```csharp
public bool IncludeWarningControls { get; set; }
```